if (condition) {
    // код, выполняющийся при соблюдении условия
}

if (condition) {
    // код, выполняющийся при соблюдении условия
} else {
    // код, выполняющийся в противном случае
}

if (condition1) {
    // при первом условии
} else if (consition2) {
    // при втором условии
} else if (condition3) {
    // при третьем условии
} else {
    // если ни одно условие не соблюдено
}

// пример с дискриминантом
let d = 10;

if (d > 0) {
    // вычисляем x1, x2
} else if (d === 0) {
    // вычисляем единственное значение x
} else {
    // выводим сообщение, что корнем является комплексное значение
}
